In [58]:
import numpy as np
import pandas as pd

In [59]:
# problem statement: perform Data cleaning steps to the given example 
# of the datasets in the Assigment

In [60]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_Paris', 'Brussels_londOn'],
                   'FlightNumber': [10045,np.nan,10065,np.nan,10085],
                   'RecentDelays':[[23,47],[],[24,43,87],[13],[67,32]],
                    'Airline': ['KLM(!)','<Air France> (12)','(British Airways)','12.Air France',"Swiss Air"]})

In [61]:
df.head()

            From_To  FlightNumber  RecentDelays            Airline
0      LoNDon_paris       10045.0      [23, 47]             KLM(!)
1      MAdrid_miLAN           NaN            []  <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways)
3    Budapest_Paris           NaN          [13]      12.Air France
4   Brussels_londOn       10085.0      [67, 32]          Swiss Air

In [62]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   From_To       5 non-null      object
 1   FlightNumber  3 non-null      float64
 2   RecentDelays  5 non-null      object
 3   Airline       5 non-null      object
dtypes: float64(1), object(3)
memory usage: 288.0+ bytes

In [63]:
# 1. Some values in the the FlightNumber column are missing. These numbers are
# meant to increase by 10 with each row so 10055 and 10075 need to be put in
# place. Fill in these missing numbers and make the column an integer column
# (instead of a float column).

In [64]:
## Shortcut method
# data_new = df
##data_new.head()
##data_new['FlightNumber'] = data_new['FlightNumber'].interpolate().astype(int)
#data_new.head()

In [65]:
# using For loop 

for i in range(1, df['FlightNumber'].count() + 1):
      if pd.isnull(df.loc[i,'FlightNumber']):
        df.loc[i, 'FlightNumber'] = df.loc[i-1, 'FlightNumber'] + 10

In [66]:
#changing the index of the data
df['FlightNumber']

0    10045.0
1    10055.0
2    10065.0
3    10075.0
4    10085.0
Name: FlightNumber, dtype: float64

In [67]:
# changing data type
df['FlightNumber']= df['FlightNumber'].astype(int)

In [69]:
df['FlightNumber']

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int64

In [ ]:
# #The From_To column would be better as two separate columns! Split each
# string on the underscore delimiter _ to give a new temporary DataFrame with
# the correct values. Assign the correct column names to this temporary
# DataFrame.

In [ ]:
#df['From' ,'To'] = df.From_To.str.split("_", expand = True)

In [99]:
# creating  temp dataset
df_temp = df.copy()

In [100]:
# Splitting the column into two based on underscore "_" delimiter
df_temp[['From','To']] = df_temp.From_To.str.split("_", expand=True )

In [101]:
df_temp

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways),londON,StockhOlm
3,Budapest_Paris,10075,[13],12.Air France,Budapest,Paris
4,Brussels_londOn,10085,"[67, 32]",Swiss Air,Brussels,londOn

In [102]:
#  Notice how the capitalisation of the city names is all mixed up in this
# temporary DataFrame. Standardise the strings so that only the first letter is
# uppercase (e.g. "londON" should become "London".)

In [103]:
df_temp['From'] = df_temp['From'].str.capitalize()
df_temp['To'] = df_temp['To'].str.capitalize()

In [106]:
df_temp

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),London,Paris
1,MAdrid_miLAN,10055,[],<Air France> (12),Madrid,Milan
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways),London,Stockholm
3,Budapest_Paris,10075,[13],12.Air France,Budapest,Paris
4,Brussels_londOn,10085,"[67, 32]",Swiss Air,Brussels,London

In [107]:
df_temp.From_To = df_temp.From_To.str.capitalize()

In [108]:
df_temp

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,London_paris,10045,"[23, 47]",KLM(!),London,Paris
1,Madrid_milan,10055,[],<Air France> (12),Madrid,Milan
2,London_stockholm,10065,"[24, 43, 87]",(British Airways),London,Stockholm
3,Budapest_paris,10075,[13],12.Air France,Budapest,Paris
4,Brussels_london,10085,"[67, 32]",Swiss Air,Brussels,London

In [109]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways),londON,StockhOlm
3,Budapest_Paris,10075,[13],12.Air France,Budapest,Paris
4,Brussels_londOn,10085,"[67, 32]",Swiss Air,Brussels,londOn

In [110]:
# dropping the From_to column from df
df.drop('From_To', axis=1,  inplace=True)
df

   FlightNumber  RecentDelays            Airline      From         To
0         10045      [23, 47]             KLM(!)    LoNDon      paris
1         10055            []  <Air France> (12)    MAdrid      miLAN
2         10065  [24, 43, 87]  (British Airways)    londON  StockhOlm
3         10075          [13]      12.Air France  Budapest      Paris
4         10085      [67, 32]          Swiss Air  Brussels     londOn

In [111]:
#Adding the From_to column from df_temp
df['From_To']= df_temp['From_To']
df

,FlightNumber,RecentDelays,Airline,From,To,From_To
0,10045,"[23, 47]",KLM(!),LoNDon,paris,London_paris
1,10055,[],<Air France> (12),MAdrid,miLAN,Madrid_milan
2,10065,"[24, 43, 87]",(British Airways),londON,StockhOlm,London_stockholm
3,10075,[13],12.Air France,Budapest,Paris,Budapest_paris
4,10085,"[67, 32]",Swiss Air,Brussels,londOn,Brussels_london

In [ ]:
# In the RecentDelays column, the values have been entered into the
# DataFrame as a list. We would like each first value in its own column, each

# second value in its own column, and so on. If there isn't an Nth value, the value
# should be NaN.
# Expand the Series of lists into a DataFrame named delays, rename the columns
# delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
# with delays.